// 将 PC9 输出1

// PC6
#include "stdint.h"
int main()
{
    // // 首先，开GPIOC的时钟
    // *(uint32_t *)(0x40021000 + 0x14) |= (1 << 19);
    // // 然后,配置PC9工作模式
    // *(uint32_t *)(0x48000800 + 0x04) |= (1 << 4);
    // *(uint32_t *)(0x48000800 + 0x04) &= ~(7 << 5);
    // // 最后,输出1
    // *(uint32_t *)(0x48000800 + 0x0C) |= (1 << 9);
    *(uint32_t *)(0x40021000 + 0x14) |= (1 << 19);
    *(uint32_t *)(0x48000800 + 0x00) |= (1 << 24);
    *(uint32_t *)(0x48000800 + 0x00) &= ~(7 << 25);
    *(uint32_t *)(0x48000800 + 0x0C) |= (1 << 6);
    while (1)
    {
    }
}

void SystemInit()
{
}
